src/InformationRegisters/НастройкиУчетаНалогаНаПрибыль/НастройкиУчетаНалогаНаПрибыль.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиУчетаНалогаНаПрибыль</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>ПорядокУплатыАвансовПоНалогуНаПрибыль</name>
    <type>
      <types>EnumRef.ПорядокУплатыАвансовПоНалогуНаПрибыль</types>
    </type>
  </resources>
  <resources>
    <name>БазаРаспределенияКосвенныхРасходовПоВидамДеятельности</name>
    <type>
      <types>EnumRef.БазыРаспределенияКосвенныхРасходовПоВидамДеятельности</types>
    </type>
  </resources>
  <resources>
    <name>ФормироватьРезервыПоСомнительнымДолгамНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПериодичностьРезервовПоСомнительнымДолгамНУ</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>ВключатьВСоставНалоговыхРасходовАрендныеПлатежи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МетодНачисленияАмортизацииНУ</name>
    <type>
      <types>EnumRef.МетодыНачисленияАмортизации</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойВариантНалогообложенияПрибыли</name>
    <type>
      <types>CatalogRef.ВариантыНалогообложенияПрибыли</types>
    </type>
  </resources>
  <resources>
    <name>РаздельныйУчетПоНалогуНаПрибыль</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоказательОпределенияДолиПрибыли</name>
    <type>
      <types>EnumRef.ПоказателиДляОпределенияДолиПрибыли</types>
    </type>
  </resources>
  <resources>
    <name>УплачиватьНалогПоГруппамОбособленныхПодразделений</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьДатаНачалаПрименения67ФЗ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьДатаНачалаПрименения67ФЗДляДепозитов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНезависимогоПризнанияДоходовРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПорядокУчетаОСБУ/ПорядокУчетаОСБУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПорядокУчетаОСБУ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СостояниеБУ</name>
    <type>
      <types>EnumRef.СостоянияОС</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеНУ</name>
    <type>
      <types>EnumRef.СостоянияОС</types>
    </type>
  </resources>
  <resources>
    <name>НачислятьАмортизациюБУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НачислятьАмортизациюНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяРасходовБУ</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаРасходовБУ</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяРасходовНУ</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаРасходовНУ</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяРасходовАмортизационнойПремии</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаРасходовАмортизационнойПремии</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>ПередаватьРасходыВДругуюОрганизацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОрганизацияПолучательРасходов</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>СчетПередачиРасходов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СпособОтраженияРасходовБУ</name>
    <type>
      <types>DocumentRef.ИзменениеПараметровОС2_4</types>
      <types>DocumentRef.ИзменениеПараметровОС</types>
    </type>
  </resources>
  <resources>
    <name>СпособОтраженияРасходовНУ</name>
    <type>
      <types>DocumentRef.ИзменениеПараметровОС2_4</types>
      <types>DocumentRef.ИзменениеПараметровОС</types>
    </type>
  </resources>
  <resources>
    <name>СпособОтраженияРасходовАмортизационнойПремии</name>
    <type>
      <types>DocumentRef.ИзменениеПараметровОС2_4</types>
    </type>
  </resources>
  <resources>
    <name>АмортизационнаяГруппа</name>
    <type>
      <types>EnumRef.АмортизационныеГруппы</types>
    </type>
  </resources>
  <resources>
    <name>НедвижимоеИмущество</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИсправления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/СтоимостьОС/СтоимостьОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СтоимостьОС</name>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьНУ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПР</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьВР</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьЦФ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьНУЦФ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПРЦФ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьВРЦФ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитываемаяСтоимостьНУ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>АмортизационнаяПремия</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>РезервПереоценкиСтоимости</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>РезервПереоценкиСтоимостиРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПриростСтоимости</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПриростСтоимостиРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ЗалоговаяСтоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ПредварительнаяСтоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПредварительнаяСтоимостьРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>КорОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КорПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>КорГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаВнеоборотныхАктивов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорНаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>КорКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорАналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорПостояннаяРазница</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>КорВременнаяРазница</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитикиКапитализацииРасходов</name>
    <type>
      <types>EnumRef.ВидыАналитикиКапитализацииРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаКапитализацииРасходов</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
      <types>CatalogRef.ОбъектыСтроительства</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПримененияЦелевогоФинансирования</name>
    <type>
      <types>EnumRef.ВариантыПримененияЦелевогоФинансирования</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВРеглУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВУпрУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетСтоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.НастройкиХозяйственныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаВнеоборотныхАктивов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Арендатор</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/CommonModules/РасчетСтоимостиВНАЛокализация/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Локализованные процедуры, связанные с расчетом стоимости ОС и НМА
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьРасчетРасходов(РасчетРасходов, ТаблицаОбъектов) Экспорт

	//++ Локализация
	ОбработатьРасчетРасходовПриЦелевомФинансировании(РасчетРасходов, ТаблицаОбъектов);
	КорректировкаСтоимостиАрендованногоИмущества(РасчетРасходов, ТаблицаОбъектов);
	//-- Локализация
	
КонецПроцедуры

Функция ТекстЗапросаВтРасчетСтоимости() Экспорт

	ТекстЗапроса = Неопределено;
	
	//++ Локализация
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТекущиеРасходы.Ссылка                    КАК Ссылка,
	|	ТекущиеРасходы.Организация               КАК Организация,
	|	ТекущиеРасходы.ИдентификаторСтроки       КАК ИдентификаторСтроки,
	|	ТекущиеРасходы.ИдентификаторСтрокиБУ     КАК ИдентификаторСтрокиБУ,
	|	ТекущиеРасходы.ИдентификаторСтрокиНУ     КАК ИдентификаторСтрокиНУ,
	|	ТекущиеРасходы.ОбъектУчета               КАК ОбъектУчета,
	|	ТекущиеРасходы.СтатьяРасходов            КАК КорСтатьяРасходов,
	|	ТекущиеРасходы.АналитикаРасходов         КАК КорАналитикаРасходов,
	|	ТекущиеРасходы.Подразделение             КАК КорПодразделение,
	|	ТекущиеРасходы.НаправлениеДеятельности   КАК КорНаправлениеДеятельности,
	|
	|	ТекущиеРасходы.СуммаУпр                  КАК Стоимость,
	|	ТекущиеРасходы.Сумма                     КАК Сумма,
	|
	// СтоимостьРегл
	|	ВЫБОР
	|		КОГДА ВтТаблицаОбъектов.ВариантПримененияЦелевогоФинансирования = ЗНАЧЕНИЕ(Перечисление.ВариантыПримененияЦелевогоФинансирования.Полное)
	|			ТОГДА 0
	|		ИНАЧЕ ТекущиеРасходы.СуммаРегл - ТекущиеРасходы.СуммаЦФ
	|	КОНЕЦ КАК СтоимостьРегл,
	|
	// СтоимостьНУ
	|	ВЫБОР
	|		КОГДА НЕ втУчетнаяПолитика.ПлательщикНалогаНаПрибыль
	|				ИЛИ ВтТаблицаОбъектов.ВариантПримененияЦелевогоФинансирования = ЗНАЧЕНИЕ(Перечисление.ВариантыПримененияЦелевогоФинансирования.Полное)
	|			ТОГДА 0
	|		ИНАЧЕ ТекущиеРасходы.СуммаРегл
	|				- ТекущиеРасходы.ПостояннаяРазница
	|				- ТекущиеРасходы.ВременнаяРазница
	|				- (ТекущиеРасходы.СуммаЦФ - ТекущиеРасходы.СуммаПРЦФ - ТекущиеРасходы.СуммаВРЦФ) 
	|				- ТекущиеРасходы.НеУчитываемаяСтоимостьНУ
	|	КОНЕЦ КАК СтоимостьНУ,
	|
	// СтоимостьПР
	|	ВЫБОР
	|		КОГДА ВтТаблицаОбъектов.ВариантПримененияЦелевогоФинансирования = ЗНАЧЕНИЕ(Перечисление.ВариантыПримененияЦелевогоФинансирования.Полное)
	|			ТОГДА 0
	|		ИНАЧЕ ТекущиеРасходы.ПостояннаяРазница - ТекущиеРасходы.СуммаПРЦФ
	|	КОНЕЦ КАК СтоимостьПР,
	|
	// СтоимостьВР
	|	ВЫБОР
	|		КОГДА ВтТаблицаОбъектов.ВариантПримененияЦелевогоФинансирования = ЗНАЧЕНИЕ(Перечисление.ВариантыПримененияЦелевогоФинансирования.Полное)
	|			ТОГДА 0
	|		ИНАЧЕ ТекущиеРасходы.ВременнаяРазница - ТекущиеРасходы.СуммаВРЦФ + ТекущиеРасходы.НеУчитываемаяСтоимостьНУ
	|	КОНЕЦ КАК СтоимостьВР,
	|
	|	0 КАК СтоимостьЦФ,
	|	0 КАК СтоимостьНУЦФ,
	|	0 КАК СтоимостьПРЦФ,
	|	0 КАК СтоимостьВРЦФ,
	|
	// КорСуммаНУ
	|	ВЫБОР
	|		КОГДА ВтТаблицаОбъектов.ВариантПримененияЦелевогоФинансирования = ЗНАЧЕНИЕ(Перечисление.ВариантыПримененияЦелевогоФинансирования.Полное)
	|			ТОГДА 0
	|		ИНАЧЕ ТекущиеРасходы.СуммаРегл - ТекущиеРасходы.ПостояннаяРазница - ТекущиеРасходы.ВременнаяРазница
	|				- (ТекущиеРасходы.СуммаЦФ - ТекущиеРасходы.СуммаПРЦФ - ТекущиеРасходы.СуммаВРЦФ)
	|	КОНЕЦ КАК КорСуммаНУ,
	|
	// КорПостояннаяРазница
	|	ВЫБОР  
	|		КОГДА ВтТаблицаОбъектов.ВариантПримененияЦелевогоФинансирования = ЗНАЧЕНИЕ(Перечисление.ВариантыПримененияЦелевогоФинансирования.Полное)
	|			ТОГДА 0
	|		ИНАЧЕ ТекущиеРасходы.ПостояннаяРазница - ТекущиеРасходы.СуммаПРЦФ
	|	КОНЕЦ КАК КорПостояннаяРазница,
	|
	|	ТекущиеРасходы.НеУчитываемаяСтоимостьНУ КАК НеУчитываемаяСтоимостьНУ,
	|	ТекущиеРасходы.СуммаНДД КАК СуммаНДД
	|
	|ПОМЕСТИТЬ ВтРасчетСтоимости
	|
	|ИЗ
	|	втТекущиеРасходы КАК ТекущиеРасходы
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтТаблицаОбъектов КАК ВтТаблицаОбъектов
	|		ПО ВтТаблицаОбъектов.Ссылка = ТекущиеРасходы.Ссылка
	|			И ВтТаблицаОбъектов.ОбъектУчета = ТекущиеРасходы.ОбъектУчета
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втУчетнаяПолитика КАК втУчетнаяПолитика
	|		ПО втУчетнаяПолитика.Организация = ТекущиеРасходы.Организация
	|
	|ГДЕ
	|	ТекущиеРасходы.СуммаУпр <> 0
	|		ИЛИ ВтТаблицаОбъектов.ВариантПримененияЦелевогоФинансирования <> ЗНАЧЕНИЕ(Перечисление.ВариантыПримененияЦелевогоФинансирования.Полное)
	|			И (ТекущиеРасходы.СуммаРегл <> 0
	|				ИЛИ ТекущиеРасходы.ПостояннаяРазница <> 0
	|				ИЛИ ТекущиеРасходы.ВременнаяРазница <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТекущиеРасходы.Ссылка                    КАК Ссылка,
	|	ТекущиеРасходы.Организация               КАК Организация,
	|	ТекущиеРасходы.ИдентификаторСтроки       КАК ИдентификаторСтроки,
	|	ТекущиеРасходы.ИдентификаторСтрокиБУ     КАК ИдентификаторСтрокиБУ,
	|	ТекущиеРасходы.ИдентификаторСтрокиНУ     КАК ИдентификаторСтрокиНУ,
	|	ТекущиеРасходы.ОбъектУчета               КАК ОбъектУчета,
	|	ТекущиеРасходы.СтатьяРасходов            КАК КорСтатьяРасходов,
	|	ТекущиеРасходы.АналитикаРасходов         КАК КорАналитикаРасходов,
	|	ТекущиеРасходы.Подразделение             КАК КорПодразделение,
	|	ТекущиеРасходы.НаправлениеДеятельности   КАК КорНаправлениеДеятельности,
	|
	|	0 КАК Стоимость,
	|	0 КАК Сумма,
	|
	|	0 КАК СтоимостьРегл,
	|	0 КАК СтоимостьНУ,
	|	0 КАК СтоимостьПР,
	|	0 КАК СтоимостьВР,
	|
	// СтоимостьЦФ
	|	ВЫБОР ВтТаблицаОбъектов.ВариантПримененияЦелевогоФинансирования
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыПримененияЦелевогоФинансирования.Полное)
	|			ТОГДА ТекущиеРасходы.СуммаРегл
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыПримененияЦелевогоФинансирования.Частичное)
	|			ТОГДА ТекущиеРасходы.СуммаЦФ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтоимостьЦФ,
	|
	// СтоимостьНУЦФ
	|	0 КАК СтоимостьНУЦФ,
	|
	// СтоимостьПРЦФ
	|	ВЫБОР ВтТаблицаОбъектов.ВариантПримененияЦелевогоФинансирования
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыПримененияЦелевогоФинансирования.Полное)
	|			ТОГДА ТекущиеРасходы.СуммаРегл
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыПримененияЦелевогоФинансирования.Частичное)
	|			ТОГДА ТекущиеРасходы.СуммаЦФ 
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтоимостьПРЦФ,
	|
	// СтоимостьВРЦФ
	|	0 КАК СтоимостьВРЦФ,
	|
	// КорСуммаНУ
	|	ВЫБОР ВтТаблицаОбъектов.ВариантПримененияЦелевогоФинансирования
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыПримененияЦелевогоФинансирования.Полное)
	|			ТОГДА ТекущиеРасходы.СуммаРегл - ТекущиеРасходы.ПостояннаяРазница - ТекущиеРасходы.ВременнаяРазница
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыПримененияЦелевогоФинансирования.Частичное)
	|			ТОГДА ТекущиеРасходы.СуммаЦФ - ТекущиеРасходы.СуммаПРЦФ - ТекущиеРасходы.СуммаВРЦФ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КорСуммаНУ,
	|
	// КорПостояннаяРазница
	|	ВЫБОР ВтТаблицаОбъектов.ВариантПримененияЦелевогоФинансирования
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыПримененияЦелевогоФинансирования.Полное)
	|			ТОГДА ТекущиеРасходы.ПостояннаяРазница
	|		ИНАЧЕ ТекущиеРасходы.СуммаПРЦФ
	|	КОНЕЦ КАК КорПостояннаяРазница,
	|
	|	0 КАК НеУчитываемаяСтоимостьНУ,
	|	ТекущиеРасходы.СуммаНДД КАК СуммаНДД
	|
	|ИЗ
	|	втТекущиеРасходы КАК ТекущиеРасходы
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтТаблицаОбъектов КАК ВтТаблицаОбъектов
	|		ПО ВтТаблицаОбъектов.Ссылка = ТекущиеРасходы.Ссылка
	|			И ВтТаблицаОбъектов.ОбъектУчета = ТекущиеРасходы.ОбъектУчета
	|
	|ГДЕ
	|	ВтТаблицаОбъектов.ВариантПримененияЦелевогоФинансирования = ЗНАЧЕНИЕ(Перечисление.ВариантыПримененияЦелевогоФинансирования.Полное)
	|	ИЛИ ВтТаблицаОбъектов.ВариантПримененияЦелевогоФинансирования = ЗНАЧЕНИЕ(Перечисление.ВариантыПримененияЦелевогоФинансирования.Частичное)
	|		И (ТекущиеРасходы.СуммаЦФ <> 0
	|			ИЛИ ТекущиеРасходы.СуммаПРЦФ <> 0
	|			ИЛИ ТекущиеРасходы.СуммаВРЦФ <> 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|";
	
	//-- Локализация
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтУчетнаяПолитика() Экспорт
	
	ТекстЗапроса = Неопределено;
	
	//++ Локализация
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СписокОрганизаций.Организация КАК Организация,
	|	НастройкиУчетаНалогаНаПрибыль.ВключатьВСоставНалоговыхРасходовАрендныеПлатежи КАК ВключатьВСоставНалоговыхРасходовАрендныеПлатежи,
	|	НастройкиСистемыНалогообложения.ПлательщикНалогаНаПрибыль КАК ПлательщикНалогаНаПрибыль
	|	
	|ПОМЕСТИТЬ ВтУчетнаяПолитика
	|
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ВтПорцияДанныхКРасчету.Организация КАК Организация,
	|		ВЫРАЗИТЬ(ВтПорцияДанныхКРасчету.Организация КАК Справочник.Организации).ГоловнаяОрганизация КАК ГоловнаяОрганизация
	|	ИЗ
	|		ВтПорцияДанныхКРасчету КАК ВтПорцияДанныхКРасчету
	|		
	|	) КАК СписокОрганизаций
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаНалогаНаПрибыль.СрезПоследних(&КонецМесяца) КАК НастройкиУчетаНалогаНаПрибыль
	|		ПО НастройкиУчетаНалогаНаПрибыль.Организация = СписокОрганизаций.ГоловнаяОрганизация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиСистемыНалогообложения.СрезПоследних(&КонецМесяца) КАК НастройкиСистемыНалогообложения
	|		ПО НастройкиСистемыНалогообложения.Организация = СписокОрганизаций.ГоловнаяОрганизация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|";
	
	//-- Локализация

	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ДополнитьТипыДокументовДвиженияКоторыхНужноПеренестиНаНачалоМесяца(ТипыОбъектов) Экспорт

	//++ Локализация
	ВнеоборотныеАктивыСлужебный.ДобавитьТипОбъектаМетаданных("РаспределениеНДС", Ложь, ТипыОбъектов);
	//-- Локализация
	
КонецПроцедуры

Процедура УчестьОтражениеВУчетеПриРасчетеСтоимости(ДанныеСтроки, СтрокаДокумента) Экспорт

	//++ Локализация
	
	Если НЕ СтрокаДокумента.ОтражатьВБУ
		И НЕ СтрокаДокумента.ОтражатьВНУ Тогда
								
		ДанныеСтроки.СуммаРегл = 0;
		ДанныеСтроки.ПостояннаяРазница = 0;
		ДанныеСтроки.ВременнаяРазница  = 0;
		
	ИначеЕсли СтрокаДокумента.ОтражатьВБУ
		И НЕ СтрокаДокумента.ОтражатьВНУ Тогда
								
		ДанныеСтроки.ВременнаяРазница = ДанныеСтроки.СуммаРегл - ДанныеСтроки.ПостояннаяРазница;
		
	ИначеЕсли НЕ СтрокаДокумента.ОтражатьВБУ
		И СтрокаДокумента.ОтражатьВНУ Тогда
								
		ДанныеСтроки.ВременнаяРазница = -(ДанныеСтроки.СуммаРегл - ДанныеСтроки.ВременнаяРазница - ДанныеСтроки.ПостояннаяРазница);
		ДанныеСтроки.СуммаРегл = 0;
		ДанныеСтроки.ПостояннаяРазница = 0;
		
	КонецЕсли;
	
	//-- Локализация
	
КонецПроцедуры

Процедура ЗаписатьТаблицыДвижений(ТаблицыДвижений, ПараметрыВыполнения) Экспорт
	
	//++ Локализация
	
	Если ПараметрыВыполнения.СформироватьЗадания Тогда
		СформироватьЗаданияКДоначислениюНалогаНаИмущество(ПараметрыВыполнения.МенеджерВременныхТаблиц);
	КонецЕсли;
	
	//-- Локализация
	
КонецПроцедуры

//++ Локализация

Процедура ОбработатьРасчетРасходовПриЦелевомФинансировании(РасчетРасходов, ТаблицаОбъектов)

	Для Каждого ДанныеОбъекта Из ТаблицаОбъектов Цикл
		
		Если ДанныеОбъекта.ВариантПримененияЦелевогоФинансирования <> Перечисления.ВариантыПримененияЦелевогоФинансирования.Частичное Тогда
			Продолжить;
		КонецЕсли; 
			
		// Сумму целевых средств нужно распределить пропорционально по строкам расходов.
		СтоимостьРеглКоэффициенты = Новый Массив;
		
		СтруктураПоиска = Новый Структура("АналитикаРасходов", ДанныеОбъекта.АналитикаКапитализацииРасходов);
		СписокСтрок = РасчетРасходов.НайтиСтроки(СтруктураПоиска);
		Для каждого СтрокаРасход Из СписокСтрок Цикл
			СтоимостьРеглКоэффициенты.Добавить(СтрокаРасход.СуммаРегл);
		КонецЦикла; 
		
		СуммаЦФ = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ДанныеОбъекта.СуммаЦелевыхСредств, СтоимостьРеглКоэффициенты);
		
		Для Сч = 0 По СписокСтрок.ВГраница() Цикл
			
			СтрокаРасход = СписокСтрок[Сч];
			
			СтрокаРасход.СуммаЦФ = ?(СуммаЦФ <> Неопределено, СуммаЦФ[Сч], 0);
			СтрокаРасход.СуммаПРЦФ = Мин(СтрокаРасход.СуммаЦФ, СтрокаРасход.ПостояннаяРазница);
			СтрокаРасход.СуммаВРЦФ = СтрокаРасход.СуммаЦФ - СтрокаРасход.СуммаПРЦФ;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура КорректировкаСтоимостиАрендованногоИмущества(РасчетРасходов, ТаблицаОбъектов)

	Для Каждого ДанныеОбъекта Из ТаблицаОбъектов Цикл
		
		Если ДанныеОбъекта.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПринятиеКУчетуПредметовАренды
			ИЛИ НЕ ДанныеОбъекта.ВключатьВСоставНалоговыхРасходовАрендныеПлатежи Тогда
			Продолжить;
		КонецЕсли; 
			
		// Стоимость в НУ распределить пропорционально по строкам расходов.
		СтоимостьНУКоэффициенты = Новый Массив;
		
		СтруктураПоиска = Новый Структура("АналитикаРасходов", ДанныеОбъекта.АналитикаКапитализацииРасходов);
		СписокСтрок = РасчетРасходов.НайтиСтроки(СтруктураПоиска);
		Для каждого СтрокаРасход Из СписокСтрок Цикл
			СтоимостьНУКоэффициенты.Добавить(СтрокаРасход.СуммаРегл - СтрокаРасход.ПостояннаяРазница - СтрокаРасход.ВременнаяРазница);
		КонецЦикла; 
		
		СуммаНУ = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ДанныеОбъекта.СтоимостьНУ, СтоимостьНУКоэффициенты);

		Если СуммаНУ = Неопределено Тогда
			Продолжить
		КонецЕсли;
		
		Для Сч = 0 По СписокСтрок.ВГраница() Цикл
			
			СтрокаРасход = СписокСтрок[Сч];
			СтрокаРасход.НеУчитываемаяСтоимостьНУ = СтоимостьНУКоэффициенты[Сч] - СуммаНУ[Сч];
			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

Процедура СформироватьЗаданияКДоначислениюНалогаНаИмущество(МенеджерВременныхТаблиц) Экспорт
	
	ИспользуемыеВТ = ОбщегоНазначенияУТ.СписокВременныхТаблиц(МенеджерВременныхТаблиц);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПорядокУчетаОСБУ.Организация КАК Организация,
	|	ПорядокУчетаОСБУ.ОсновноеСредство КАК ОсновноеСредство,
	|	МАКСИМУМ(ПорядокУчетаОСБУ.Период) КАК Период
	|ПОМЕСТИТЬ ДатыДляСрезаПоследних
	|ИЗ
	|	РегистрСведений.ПорядокУчетаОСБУ КАК ПорядокУчетаОСБУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтТаблицаОбъектов КАК ВтТаблицаОбъектов
	|		ПО ПорядокУчетаОСБУ.Организация = ВтТаблицаОбъектов.Организация
	|			И ПорядокУчетаОСБУ.ОсновноеСредство = ВтТаблицаОбъектов.ОбъектУчета
	|ГДЕ
	|	ПорядокУчетаОСБУ.Период <= КОНЕЦПЕРИОДА(ВтТаблицаОбъектов.Дата, МЕСЯЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПорядокУчетаОСБУ.Организация,
	|	ПорядокУчетаОСБУ.ОсновноеСредство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПорядокУчетаОСБУ.Организация КАК Организация,
	|	ПорядокУчетаОСБУ.ОсновноеСредство КАК ОсновноеСредство,
	|	ПорядокУчетаОСБУ.НедвижимоеИмущество КАК НедвижимоеИмущество
	|ПОМЕСТИТЬ ПризнакНедвижимогоИмущества
	|ИЗ
	|	ДатыДляСрезаПоследних КАК ДатыДляСрезаПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУчетаОСБУ КАК ПорядокУчетаОСБУ
	|		ПО ДатыДляСрезаПоследних.Организация = ПорядокУчетаОСБУ.Организация
	|			И ДатыДляСрезаПоследних.ОсновноеСредство = ПорядокУчетаОСБУ.ОсновноеСредство
	|			И ДатыДляСрезаПоследних.Период = ПорядокУчетаОСБУ.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтТаблицаОбъектов.Ссылка КАК Ссылка,
	|	ВтТаблицаОбъектов.Организация КАК Организация,
	|	ВтТаблицаОбъектов.ОбъектУчета КАК ОбъектУчета,
	|	ВтТаблицаОбъектов.Дата КАК Месяц,
	|	ЕСТЬNULL(ПризнакНедвижимогоИмущества.НедвижимоеИмущество, ЛОЖЬ) КАК НедвижимоеИмущество
	|ПОМЕСТИТЬ ВтСписокОбъектов
	|ИЗ
	|	ВтТаблицаОбъектов КАК ВтТаблицаОбъектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПризнакНедвижимогоИмущества КАК ПризнакНедвижимогоИмущества
	|		ПО ВтТаблицаОбъектов.Организация = ПризнакНедвижимогоИмущества.Организация
	|			И ВтТаблицаОбъектов.ОбъектУчета = ПризнакНедвижимогоИмущества.ОсновноеСредство
	|ГДЕ
	|	КОНЕЦПЕРИОДА(ВтТаблицаОбъектов.Дата, МЕСЯЦ) = КОНЕЦПЕРИОДА(ВтТаблицаОбъектов.Дата, КВАРТАЛ)
	|	И ЕСТЬNULL(ПризнакНедвижимогоИмущества.НедвижимоеИмущество, ЛОЖЬ) = ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСтоимости.Ссылка КАК Ссылка,
	|	ТаблицаСтоимости.Организация КАК Организация,
	|	ТаблицаСтоимости.ОбъектУчета КАК ОбъектУчета
	|
	|ПОМЕСТИТЬ ВТ_РазницаВСтоимостиОС
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаСтоимости.Регистратор КАК Ссылка,
	|		ТаблицаСтоимости.Организация КАК Организация,
	|		ТаблицаСтоимости.ОсновноеСредство КАК ОбъектУчета,
	|
	|		ТаблицаСтоимости.Стоимость КАК ФактическаяСтоимостьУУ,
	|		ТаблицаСтоимости.СтоимостьРегл + ТаблицаСтоимости.СтоимостьЦФ КАК ФактическаяСтоимостьБУ,
	|
	|		0 КАК ПредварительнаяСтоимостьУУ,
	|		0 КАК ПредварительнаяСтоимостьБУ
	|	ИЗ
	|		РегистрНакопления.СтоимостьОС КАК ТаблицаСтоимости
	|
	|	ГДЕ
	|		ТаблицаСтоимости.РасчетСтоимости
	|		И ТаблицаСтоимости.Регистратор В
	|				(ВЫБРАТЬ
	|					ВтСписокОбъектов.Ссылка
	|				ИЗ
	|					ВтСписокОбъектов КАК ВтСписокОбъектов)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаСтоимости.Ссылка КАК Ссылка,
	|		ТаблицаСтоимости.Ссылка.Организация КАК Организация,
	|		ТаблицаСтоимости.ОсновноеСредство КАК ОбъектУчета,
	|
	|		0 КАК ФактическаяСтоимостьУУ,
	|		0 КАК ФактическаяСтоимостьБУ,
	|
	|		ТаблицаСтоимости.СтоимостьУУ КАК ПредварительнаяСтоимостьУУ,
	|		ТаблицаСтоимости.СтоимостьБУ КАК ПредварительнаяСтоимостьБУ
	|	ИЗ
	|		Документ.ПринятиеКУчетуОС2_4.ОС КАК ТаблицаСтоимости
	|
	|	ГДЕ
	|		ТаблицаСтоимости.Ссылка В
	|				(ВЫБРАТЬ
	|					ВтСписокОбъектов.Ссылка
	|				ИЗ
	|					ВтСписокОбъектов КАК ВтСписокОбъектов)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаСтоимости.Ссылка КАК Ссылка,
	|		ТаблицаСтоимости.Ссылка.Организация КАК Организация,
	|		ТаблицаСтоимости.ОсновноеСредство КАК ОбъектУчета,
	|
	|		0 КАК ФактическаяСтоимостьУУ,
	|		0 КАК ФактическаяСтоимостьБУ,
	|
	|		ТаблицаСтоимости.СтоимостьУУ КАК ПредварительнаяСтоимостьУУ,
	|		ТаблицаСтоимости.СтоимостьБУ КАК ПредварительнаяСтоимостьБУ
	|
	|	ИЗ
	|		Документ.МодернизацияОС2_4.ОС КАК ТаблицаСтоимости
	|
	|	ГДЕ
	|		ТаблицаСтоимости.Ссылка В
	|				(ВЫБРАТЬ
	|					ВтСписокОбъектов.Ссылка
	|				ИЗ
	|					ВтСписокОбъектов КАК ВтСписокОбъектов)
	|
	|	) КАК ТаблицаСтоимости
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаСтоимости.Ссылка,
	|	ТаблицаСтоимости.Организация,
	|	ТаблицаСтоимости.ОбъектУчета
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ТаблицаСтоимости.ФактическаяСтоимостьУУ) > СУММА(ТаблицаСтоимости.ПредварительнаяСтоимостьУУ)
	|		ИЛИ СУММА(ТаблицаСтоимости.ФактическаяСтоимостьБУ) > СУММА(ТаблицаСтоимости.ПредварительнаяСтоимостьБУ))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	ОбъектУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтСписокОбъектов.Ссылка КАК Документ,
	|	ВтСписокОбъектов.Организация КАК Организация,
	|	ВтСписокОбъектов.ОбъектУчета КАК ОбъектУчета,
	|	ВтСписокОбъектов.Месяц КАК Месяц
	|
	|ИЗ
	|	ВтСписокОбъектов КАК ВтСписокОбъектов
	|
	|ГДЕ
	|	(ВтСписокОбъектов.Ссылка, ВтСписокОбъектов.ОбъектУчета) В (
	|		ВЫБРАТЬ
	|			ВТ_РазницаВСтоимостиОС.Ссылка,
	|			ВТ_РазницаВСтоимостиОС.ОбъектУчета
	|		ИЗ
	|			ВТ_РазницаВСтоимостиОС КАК ВТ_РазницаВСтоимостиОС)
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	РегистрыСведений.ЗаданияКДоначислениюНалогаНаИмущество.СоздатьЗаписиРегистраПоДаннымВыборки(РезультатЗапроса.Выбрать());
	
	ОбщегоНазначенияУТ.УничтожитьВременныеТаблицы(МенеджерВременныхТаблиц,, ИспользуемыеВТ);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

//-- Локализация

#КонецОбласти
